Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
  Serial.println(F("[setup] BOOT held — keep holding to erase settings"));
  const uint32_t start = millis();
  while (digitalRead(NBUS_SETUP_BTN_PIN) == LOW) {
    if (millis() - start >= NBUS_FACTORY_HOLD_MS) {
      eraseSettings();
      return;
    }
    ledWrite((((millis() - start) / 100) % 2) != 0);  // blink while counting
    delay(10);
  }
  ledWrite(false);
  Serial.println(F("[setup] BOOT released early — settings kept"));
}

// The ESP's disconnect reason is the only thing that separates a wrong passphrase
// (reason 15, 4-way handshake timeout) from an AP that refuses or drops us.
// Every line carries millis() so the association attempts can be lined up against the
// packet counters the router reports for this MAC.
void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_START:
      Serial.printf("[wifi %8lu] STA started\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      // Association + 4-way handshake done. Reaching this at all rules out the whole
      // authentication class of faults; only DHCP can still fail after this point.
      Serial.printf("[wifi %8lu] associated, ch %d, waiting for DHCP\n",
                    millis(), (int)info.wifi_sta_connected.channel);
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      Serial.printf("[wifi %8lu] got IP\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_LOST_IP:
      Serial.printf("[wifi %8lu] lost IP\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      Serial.printf("[wifi %8lu] disconnected, reason %d\n",
                    millis(), (int)info.wifi_sta_disconnected.reason);
      break;
    default:
      break;
  }
}

// Lists what the radio can actually see. The C3 is 2.4 GHz only, so an AP that is
// missing here but visible on a phone is almost always 5 GHz.
const char* authModeName(wifi_auth_mode_t m) {
  switch (m) {
    case WIFI_AUTH_OPEN:            return "open";
    case WIFI_AUTH_WEP:             return "WEP";
    case WIFI_AUTH_WPA_PSK:         return "WPA";
    case WIFI_AUTH_WPA2_PSK:        return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK:    return "WPA/WPA2";
    case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2-ent";
    case WIFI_AUTH_WPA3_PSK:        return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK:   return "WPA2/WPA3";
    default:                        return "other";
  }
}

void logVisibleNetworks() {
  // Read from efuse, not WiFi.macAddress(): the driver is already stopped here and
  // would report all zeros.
  uint8_t mac[6] = {0};
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  Serial.printf("[wifi] stored SSID '%s', STA MAC %02X:%02X:%02X:%02X:%02X:%02X, hostname %s\n",
                wm.getWiFiSSID().c_str(), mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
                NBUS_HOSTNAME);
  // Length and character mix of the stored passphrase, never the passphrase itself.
  // A mismatch with what was typed points at the portal form mangling a character.
  const String pass = wm.getWiFiPass();
  int nonAlnum = 0, nonAscii = 0;
  for (size_t i = 0; i < pass.length(); ++i) {
    const uint8_t c = (uint8_t)pass[i];
    if (c < 32 || c > 126) ++nonAscii;
    else if (!isalnum(c))  ++nonAlnum;
  }
  Serial.printf("[wifi] stored passphrase: %u chars, %d punctuation, %d non-ASCII\n",
                (unsigned)pass.length(), nonAlnum, nonAscii);

  const int n = WiFi.scanNetworks();
  Serial.printf("[wifi] %d networks visible (2.4 GHz only):\n", n);
  for (int i = 0; i < n; ++i) {
    Serial.printf("  %-28s ch%-3d %4d dBm %s\n", WiFi.SSID(i).c_str(), WiFi.channel(i),
                  WiFi.RSSI(i), authModeName(WiFi.encryptionType(i)));
  }
  WiFi.scanDelete();
}

// The portal never blocks: reading the bus is this device's primary job and must not
// depend on Wi-Fi being provisioned. loop() drives the portal via handleProvisioning().
void startProvisioning() {
  char portBuf[8];
  snprintf(portBuf, sizeof portBuf, "%u", cfg.port);
  pHost.setValue(cfg.host.c_str(), 64);
  pPort.setValue(portBuf, 8);
  pUser.setValue(cfg.user.c_str(), 48);
  pPass.setValue(cfg.pass.c_str(), 48);
  pBase.setValue(cfg.base.c_str(), 32);
  pOtaU.setValue(cfg.otaUser.c_str(), 32);
  pOtaP.setValue(cfg.otaPass.c_str(), 32);

  // Makes the device identifiable in the router's client list instead of showing up
  // as a nameless MAC address.
  wm.setHostname(NBUS_HOSTNAME);
  wm.setSaveConfigCallback(onSaveConfig);
  wm.setConfigPortalBlocking(false);
  // Bounds the one blocking step left in autoConnect(): the attempt on the saved AP.
  // Without it WiFiManager waits on the ESP's own result, which took 60 s on a failure.
  wm.setConnectTimeout(NBUS_WIFI_CONNECT_TIMEOUT_S);
  wm.addParameter(&pHost);
  wm.addParameter(&pPort);
  wm.addParameter(&pUser);
  wm.addParameter(&pPass);
  wm.addParameter(&pBase);
  wm.addParameter(&pOtaU);
  wm.addParameter(&pOtaP);

  if (wm.autoConnect(NBUS_AP_NAME)) {
    onWifiUp();
  } else {
    g_portalActive = true;
    Serial.printf("[wifi] connect failed (status %d) - portal %s open at 192.168.4.1\n",
                  (int)WiFi.status(), NBUS_AP_NAME);
    logVisibleNetworks();
  }
}

// ---------------------------------------------------------------------------
// MQTT settings page, served over the LAN on the device's own IP. The captive
// portal exists for first-time Wi-Fi setup only; changing the broker afterwards
// should not require dropping a working device back into AP mode.
// ---------------------------------------------------------------------------
String htmlEscape(const String& s) {
  String out;
  out.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); ++i) {
    const char c = s[i];
    if      (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else if (c == '\'') out += F("&#39;");
    else               out += c;
  }
  return out;
}

