Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
  if (mqtt.connected()) {
    char topic[64];
    snprintf(topic, sizeof(topic), "%s/raw/dump", cfg.base.c_str());
    mqtt.publish(topic, path, true);
  }
}

// --------------------------------------------------------------------------
// HTTP endpoints for remote capture
// --------------------------------------------------------------------------

// /status is deliberately NOT behind auth. It is the liveness probe: if the
// credentials are ever wrong, this is how you find out the device is alive at
// all rather than guessing between "bad password" and "bricked by that OTA".
// It therefore carries nothing worth protecting — no topics, no hostnames.
void handleStatus() {
  JsonDocument doc;
  doc["version"]   = NBUS_FW_VERSION;
  doc["build"]     = NBUS_FW_BUILD;
  doc["uptime_s"]  = millis() / 1000;
  doc["heap_free"] = ESP.getFreeHeap();
  doc["heap_min"]  = ESP.getMinFreeHeap();
  doc["rssi"]      = WiFi.RSSI();
  doc["mqtt"]      = mqtt.connected();
  doc["frames"]    = g_ringTotal;
  doc["ring_used"] = ringCount();
  doc["ring_size"] = (uint32_t)NBUS_RAW_RING_ENTRIES;
  doc["bus_silent"] = g_busSilent;
  doc["last_frame_age_ms"] = g_lastFrameMs ? (millis() - g_lastFrameMs) : 0;
  // How the two packs are being told apart, and how well. A dropped count that keeps pace
  // with the accepted count means frames are being lost somewhere; readings are still
  // correct, there are just fewer of them.
  doc["cycle_expected"] = cycles.expectedPerCycle();
  doc["cycle_accepted"] = cycles.cyclesAccepted();
  doc["cycle_dropped"]  = cycles.cyclesDropped();
  doc["cycle_epoch"]    = cycles.topologyEpoch();
  // Only the count of identified packs, not which ones. Serial numbers would make this
  // endpoint worth reading, and it is deliberately the one thing served without auth.
  int named = 0;
  for (int i = 0; i < NBUS_MAX_BATTERIES; ++i) {
    if (parser.state().batt[i].id.serialValid()) ++named;
  }
  doc["batteries_identified"] = named;
  doc["fs_used"]   = g_fsReady ? LittleFS.usedBytes() : 0;
  doc["fs_total"]  = g_fsReady ? LittleFS.totalBytes() : 0;
  doc["dump_seq"]  = g_dumpSeq;
  String out;
  serializeJson(doc, out);
  httpServer.send(200, "application/json", out);
}

// Stream the live ring. `?since=<ms>` returns only entries newer than that
// timestamp, which lets a poller follow the bus without the server holding the
// connection open — a long-lived stream would block loop(), and loop() is what
// drains the UART. Starving the reader to watch the reader would be perverse.
void handleRawDump() {
  if (!requireAuth()) return;
  const uint32_t since = httpServer.hasArg("since")
                       ? (uint32_t)strtoul(httpServer.arg("since").c_str(), nullptr, 10) : 0;
  httpServer.setContentLength(CONTENT_LENGTH_UNKNOWN);
  httpServer.send(200, "text/plain", "");

  char hdr[160];
  snprintf(hdr, sizeof(hdr),
           "# nbus raw dump v1\n# fw %s\n# now_ms %lu  frames %lu  total_seen %lu\n"
           "# t_ms NAD PCI SID REG D0 D1 D2 D3\n",
           NBUS_FW_VERSION, (unsigned long)millis(),
           (unsigned long)ringCount(), (unsigned long)g_ringTotal);
  httpServer.sendContent(hdr);

  String chunk;
  chunk.reserve(1700);
  char line[48];
  const uint32_t n = ringCount();
  uint32_t idx = ringOldest();
  for (uint32_t i = 0; i < n; ++i) {
    const RawEntry& e = g_ring[idx];
    idx = (idx + 1) % NBUS_RAW_RING_ENTRIES;
    if (e.ms <= since) continue;
    formatEntry(e, line, sizeof(line));
    chunk += line;
    if (chunk.length() > 1400) {
      httpServer.sendContent(chunk);
      chunk = "";
      esp_task_wdt_reset();
    }
  }
  if (chunk.length()) httpServer.sendContent(chunk);
  httpServer.sendContent("");
}

void handleRawSave() {
  if (!requireAuth()) return;
  rawPersist("manual");
  httpServer.send(200, "text/plain", "saved\n");
}

void handleRawFiles() {
  if (!requireAuth()) return;
  if (!g_fsReady) { httpServer.send(503, "text/plain", "fs unavailable\n"); return; }
  String out;
  File dir = LittleFS.open(NBUS_RAW_DUMP_DIR);
  for (File f = dir.openNextFile(); f; f = dir.openNextFile()) {
    out += f.name();
    out += '\t';
    out += String((uint32_t)f.size());
    out += '\n';
  }
  dir.close();
  httpServer.send(200, "text/plain", out.isEmpty() ? String("(none)\n") : out);
}

void handleRawFile() {
  if (!requireAuth()) return;
  if (!g_fsReady || !httpServer.hasArg("n")) {
    httpServer.send(400, "text/plain", "usage: /raw/file?n=<name>\n");
    return;
  }
  // Take only the basename: the argument indexes our own dump directory and is
  // never allowed to walk out of it.
  String name = httpServer.arg("n");
  int slash = name.lastIndexOf('/');
  if (slash >= 0) name = name.substring(slash + 1);
  const String path = String(NBUS_RAW_DUMP_DIR) + "/" + name;
  File f = LittleFS.open(path, "r");
  if (!f) { httpServer.send(404, "text/plain", "no such dump\n"); return; }
  httpServer.streamFile(f, "text/plain");
  f.close();
}

// The only destructive endpoint here, and the file it deletes may be the sole capture of
// a bus state that took weeks to occur — so it demands confirm=yes rather than being
// reachable by a stray click or a browser prefetching a link.
//
// g_dumpSeq is deliberately not reset: sequence numbers stay monotonic across a wipe, so
// "highest number" remains "newest" and a cleared device cannot reuse the name of a dump
// someone has already downloaded.
void handleRawClear() {
  if (!requireAuth()) return;
  if (!g_fsReady) { httpServer.send(503, "text/plain", "fs unavailable\n"); return; }
  if (httpServer.arg("confirm") != "yes") {
    httpServer.send(400, "text/plain",
                    F("refused: this deletes captured evidence\n"
                      "  /raw/clear?confirm=yes           delete every dump\n"
                      "  /raw/clear?confirm=yes&n=<name>  delete one\n"));
    return;
  }

  if (httpServer.hasArg("n")) {
    String name = httpServer.arg("n");
    int slash = name.lastIndexOf('/');
    if (slash >= 0) name = name.substring(slash + 1);
    const String path = String(NBUS_RAW_DUMP_DIR) + "/" + name;
    if (!LittleFS.exists(path)) { httpServer.send(404, "text/plain", "no such dump\n"); return; }
    LittleFS.remove(path);
    httpServer.send(200, "text/plain", "deleted " + name + "\n");
    return;
  }

  // Reopen the directory for each removal, as rawPruneDumps() does: deleting through a
  // live LittleFS directory handle while iterating it does not reliably enumerate. The
  // entry must be closed before removing it — LittleFS refuses to unlink an open file,
  // and an unbounded retry on that failure is a watchdog reset.
  int removed = 0;
  for (int guard = 0; guard < NBUS_RAW_MAX_DUMPS + 4; guard++) {
    File dir = LittleFS.open(NBUS_RAW_DUMP_DIR);
    if (!dir) break;
    File f = dir.openNextFile();
    String nm = f ? String(f.name()) : String();
    if (f) f.close();
    dir.close();
    if (nm.isEmpty()) break;
    if (!LittleFS.remove(String(NBUS_RAW_DUMP_DIR) + "/" + nm)) break;
    removed++;
  }
  httpServer.send(200, "text/plain", "deleted " + String(removed) + " dump(s)\n");
}

// --------------------------------------------------------------------------
// LIN frame capture (read-only)
// --------------------------------------------------------------------------
void markFresh(int busSlot, uint8_t reg) {
  const uint32_t now = millis();
  if (busSlot == NBusCycleTracker::kSolarSlot) {
    if (reg == 0x01) g_lastStarterMs = now;
    else             g_lastSolarMs = now;
  } else if (busSlot >= 0 && busSlot < NBUS_MAX_BATTERIES) {
    g_lastBattMs[busSlot] = now;
    if (reg == 0x56 || reg == 0x57) g_lastCellMs[busSlot] = now;
  }
}

// Hand one attributed frame to the parser and the mirror.
void dispatchFrame(const NBusCycleTracker::Out& o) {
  const bool isSolar = (o.slot == NBusCycleTracker::kSolarSlot);
  const uint8_t nad  = isSolar ? NBUS_NAD_SOLAR : NBUS_NAD_BATTERY;
  const uint8_t frame[8] = { nad, 0x06, 0xF4, o.reg,
                             o.d[0], o.d[1], o.d[2], o.d[3] };

  if (parser.feedResponse(frame, sizeof frame, isSolar ? 0 : o.slot)) {
    markFresh(o.slot, o.reg);
  } else {
    // A well-formed response the parser has no meaning for. Checksum and framing already
    // hold at this point, so it is real bus content, not noise — mirror it.
    mirrorRegister(o.slot, o.reg, o.d);
  }
}

void processFrameWindow(const uint8_t* buf, size_t len) {
#ifdef NBUS_DEBUG
  // Raw window dump: during bring-up this is what separates "nothing on the wire" from
  // "bytes arrive but framing is off".
  Serial.printf("[raw %2u]", (unsigned)len);
  for (size_t i = 0; i < len; ++i) Serial.printf(" %02X", buf[i]);
  Serial.println();
#endif
  // A frame window (delimited by an idle gap) holds: [break 0x00?] 0x55 PID data... checksum.
  for (size_t i = 0; i + 1 < len; ++i) {
    if (buf[i] != 0x55) continue;
    const uint8_t pid = buf[i + 1];
    if (pid != 0x7D) return;          // not a slave response; ignore this window
    const size_t dStart = i + 2;
    if (len - dStart < 8) return;     // not enough data bytes yet
    const uint8_t* d = &buf[dStart];

    // Optional checksum verification (classic checksum: data bytes only, PID excluded).
    if (len - dStart >= 9) {
      uint8_t expect = NBusParser::classicChecksum(d, 8);
      if (expect != d[8]) {
#ifdef NBUS_DEBUG
        Serial.printf("[lin] checksum mismatch reg=%02X exp=%02X got=%02X\n", d[3], expect, d[8]);
#endif
        return;
      }
    }

